# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024, 0]
  t: [0.33, 0.375, 1024, 0]
  s: [0.33, 0.50, 1024, 0]
  m: [0.67, 0.75, 768, 0]
  l: [1.00, 1.00, 512, 0]
  x: [1.00, 1.25, 512, 0]

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]  # 9

# YOLOv8.0n head (深度密集連接版)
head:
  # --- FPN (Top-Down Pathway) ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 10: Upsampled P5 (H/16)
  
  # 節點 11 (融合 P4 尺度)：基準為 Backbone P4(6)。
  # 連接 2 個來源：[Backbone P4(6), Upsampled P5(10)]
  - [[6, 10], 1, BlockAttnResMerge, []] 
  - [-1, 3, C2f, [512]] # 12: FPN-P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13: Upsampled FPN-P4 (H/8)
  
  # 節點 14 (融合 P3 尺度)：基準為 Backbone P3(4)。
  # 跨越多層連接 4 個來源：[Backbone P3(4), Upsampled FPN-P4(13), Backbone P4(6), Backbone P5(9)]
  # (模組會自動將 6 和 9 放大對齊到 P3 尺寸)
  - [[4, 13, 6, 9], 1, BlockAttnResMerge, []]
  - [-1, 3, C2f, [256]] # 15: FPN-P3 (小目標輸出)


  # --- PANet (Bottom-Up Pathway) ---
  # 下採樣並擴增通道至 512
  - [-1, 1, Conv, [512, 3, 2]] # 16: Downsampled FPN-P3 (H/16)
  
  # 節點 17 (融合 PAN-P4 尺度)：基準為 Downsampled P3(16)。
  # 跨越多層連接 4 個來源：[Node16, FPN-P4(12), Backbone P4(6), FPN-P3(15)]
  # (模組會自動將 15 縮小對齊到 P4 尺寸)
  - [[16, 12, 6, 15], 1, BlockAttnResMerge, []]
  - [-1, 3, C2f, [512]] # 18: PAN-P4 (中目標輸出)

  # 下採樣並擴增通道至 1024
  - [-1, 1, Conv, [1024, 3, 2]] # 19: Downsampled PAN-P4 (H/32)
  
  # 節點 20 (融合 PAN-P5 尺度)：基準為 Downsampled P4(19)。
  # 跨越多層連接 4 個來源：[Node19, Backbone P5(9), FPN-P4(12), PAN-P4(18)]
  - [[19, 9, 12, 18], 1, BlockAttnResMerge, []]
  - [-1, 3, C2f, [1024]] # 21: PAN-P5 (大目標輸出)

  # Detect Layer 接收三個最終尺度的特徵圖
  - [[15, 18, 21], 1, Detect, [nc]] # 22
