# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11-pose keypoints/pose estimation model. For Usage examples see https://docs.ultralytics.com/tasks/pose

# Parameters
nc: 80 # number of classes
rtmo: True
kpt_shape: [17, 3] # number of keypoints, number of dims (2 for x,y or 3 for x,y,visible)
scales: # model compound scaling constants, i.e. 'model=yolo11n-pose.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  s: [0.50, 0.50, 1024, 0] # summary: 344 layers, 9948811 parameters, 9948795 gradients, 23.5 GFLOPs

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, FDConv_v2, [64, 3, 2]] # 0-P1/2
  - [-1, 1, FDConv_v2, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2_AttnRes, [256, False, 0.25]]
  - [-1, 1, FDConv_v2, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2_AttnRes, [512, False, 0.25]]
  - [-1, 1, FDConv_v2, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2_AttnRes, [512, True]]
  - [-1, 1, FDConv_v2, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2_AttnRes, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO11n head
head:
  - [[-1, 6], 1, FreqFusion,[]] # 11 (融合 P5 [-1] 與 P4 [6])
  - [-1, 2, C3k2_AttnRes, [512, False]] # 12

  - [[-1, 4], 1, FreqFusion,[]] # 13 (融合 P4 [-1] 與 P3 [4])
  - [-1, 2, C3k2_AttnRes, [256, False]] # 14 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2_AttnRes, [512, False]] # 17 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2_AttnRes, [1024, True]] # 20 (P5/32-large)

  - [[14, 17, 20], 1, RTMOPose, [nc, kpt_shape]] # Detect(P3, P4, P5)
