# YOLO-Master 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Parameters
nc: 80 # number of classes
kpt_shape: [17, 3] # number of keypoints, number of dims (2 for x,y or 3 for x,y,visible)
scales: # model compound scaling constants
  # [depth, width, max_channels]
  s: [0.50, 0.50, 1024, 0]

# yolo-master-backbone with Mixture of Experts (MoE) layers
backbone:
  # [from, repeats, module, args]
  - [-1, 1, mamba_vision_S, []] # 0-4 P1/2 这里是四层大家不要被yaml文件限制住了思维，不会画图进群看视频.
  - [-4, 1, ES_MOE, [256]] # 5
  - [-4, 1, ES_MOE, [512]] # 6
  - [-4, 1, ES_MOE, [512]] # 7
  - [-4, 1, ES_MOE, [1024]] # 8

# YOLO-Master head for Pose
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 7], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 11
 
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 14 (P3/8-small)
 
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, False]] # 17 (P4/16-medium)
 
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 8], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 20 (P5/32-large)

  - [[14, 17, 20], 1, Pose26, [nc, kpt_shape]] # Pose(P3, P4, P5)