# YOLO-Master 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Parameters
nc: 80 # number of classes
kpt_shape: [17, 3] # number of keypoints, number of dims (2 for x,y or 3 for x,y,visible)
scales: # model compound scaling constants
  # [depth, width, max_channels]
  s: [0.50, 0.50, 1024, 0]

# YOLO-Master-v0.1 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]

  - [-1, 1, UltraOptimizedMoE, [256, 2, 2]] # 3

  - [-1, 1, Conv, [256, 3, 2]] # 4-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]

  - [-1, 1, UltraOptimizedMoE, [512, 4, 2]] # 6

  - [-1, 1, Conv, [512, 3, 2]] # 7-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]

  - [-1, 1, UltraOptimizedMoE, [512, 8, 2]] # 9

  - [-1, 1, Conv, [1024, 3, 2]] # 10-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]]

  - [-1, 1, UltraOptimizedMoE, [1024, 16, 2]] # 12

# YOLO-Master-v0.1 head for Pose
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 9], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, True]] # 15

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, True]] # 18

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 15], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, True]] # 21

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [512, True]] # 24 (P5/32-large)

  - [[18, 21, 24], 1, Pose, [nc, kpt_shape]] # Pose(P3, P4, P5)